{"personality_traits": [{"name": "2D Character Lover", "id": 3215, "description": "This character is into 2D characters. Whether or not they prefer 2D over 3D does not matter, the only thing that matters is they love 2D characters.\n\nExample character: c9788"}, {"name": "Absentminded", "id": 929, "description": "This character is <a href=\"http://en.wikipedia.org/wiki/Absentminded\">absentminded</a>. \n\nAbsent-mindedness is a mental condition in which the subject experiences low levels of attention and frequent distraction. Absent-mindedness is not a diagnosed condition but rather a symptom of boredom and sleepiness which people experience in their daily lives. When suffering from absent-mindedness, people tend to show signs of memory lapse and weak recollection of recently occurring events. This can usually be a result of a variety of other conditions often diagnosed by clinicians such as ADD and depression. In addition to absent-mindedness leading to an array of consequences affecting daily life, it can have as more severe, long-term problems."}, {"name": "Adaptive", "id": 3904, "description": "This character is <a href=\"https://en.wikipedia.org/wiki/Adaptive_behavior\">adaptive</a>.\n\nThese characters are able to easily adjust to new situations and change their behavior to fit the demands of their environment. They are willing to bend and break habits, to challenge themselves when their circumstances change. They tend to face problems, pivot among distractions, and proceed forward. Adaptable people are prone to think ahead and consistently focus on improvement."}, {"name": "Airhead", "id": 229, "description": "This character sometimes acts like a  <a href=\"http://en.wikipedia.org/wiki/Foolishness\">fool</a>.\n\nFoolishness is the lack of wisdom. In this sense it differs from stupidity, which is the lack of intelligence."}, {"name": "Ambitious", "id": 1504, "description": "An ambitious person is defined as a person with an earnest desire for some type of achievement or distinction, such as power, honor, fame, or wealth, and the willingness to strive for its attainment."}, {"name": "Antisocial", "id": 736, "description": "This character is <a href=\"http://en.wiktionary.org/wiki/antisocial\">antisocial</a>.\n\nDifferent from just being <a href=\"http://vndb.org/i250\">shy</a> or <a href=\"http://vndb.org/i249\">reserved</a>, antisocial people are unwilling or unable to associate normally with other people. They may or may not be a <a href=\"http://vndb.org/i720\">hikikomori</a>."}, {"name": "Bookworm", "id": 1322, "description": "This character loves reading books a lot, and may spend most of their free time on it."}, {"name": "Brave", "id": 1252, "description": "This character is not afraid to face the danger head-on. They're always ready to defend their country or close people, and fulfill their duty, even if it means death."}, {"name": "Cautious", "id": 466, "description": "This character is <a href=\"http://en.wikipedia.org/wiki/Cautiousness\">cautious</a>.\n\nCautious characters are on their guard, acting with caution and watching their surroundings with alertness.\n\nAside from the people that are required to be cautious as a part of their jobs, like guards or military personnel, it is also noticed in the behaviors of people that have been in prolonged conflicts or dangerous environments."}, {"name": "Charismatic", "id": 1756, "description": "A character with this trait is a charismatic person.\n\n<a href=\"http://www.oxforddictionaries.com/definition/english/charisma\">Charisma</a> is defined as the \"compelling attractiveness or charm that can inspire devotion in others\".\n\nCharismatic people are charming, friendly and extroverted people with great social skills. They tend to be good public speakers and street smart."}, {"name": "Cinephile", "id": 2589, "description": "This trait means a character who is fond of motion pictures."}, {"name": "Clumsy", "id": 525, "description": "This character is <a href=\"http://dictionary.reference.com/browse/clumsy\">clumsy</a> or known to be <a href=\"http://en.wikipedia.org/wiki/Accident-proneness\">prone to accidents</a>.\n\nA clumsy person is someone lacking in skill or physical coordination, who tends to be prone to more accidents then others.\n\nAccident-proneness, also known as clumsiness, is the conception that some people might have predisposition, or that they might be more likely to suffer accidents, such as car crashes and industrial injuries, than other people. It may be used as a reason to deny any insurance on such individuals."}, {"name": "Competitive", "id": 1307, "description": "A character with this trait is <a href=\"http://dictionary.reference.com/browse/competitive?s=t\">competitive</a>.\n\nCompetitive people have a strong desire to compete or to succeed. They typically hate to lose."}, {"name": "Confident", "id": 864, "description": "This character is <a href=\"http://en.wikipedia.org/wiki/Confident\">confident</a>.\n\nA confident person is sure of oneself; having no uncertainty about one's own abilities, correctness or success."}, {"name": "Coward", "id": 1158, "description": "A cowardly character is someone who is lacking in courage in battles or fights.\n\nThis character will runaway most of the time without thinking much about it. Popular examples would be Matou Shinji and Zenitsu from Kimetsu no Yaiba.\n\nDo not confuse this trait with <a href=\"/i216\">Hetare</a>. Hetare is associated with an inability in making decision, while Coward is associated in facing danger and challange."}, {"name": "Creative", "id": 3908, "description": "Creative characters are excellent at using their imagination and thinking outside the box to come up with new ideas. They can come up with unexpected solutions and give a unique perspective on events."}, {"name": "Cruel", "id": 1525, "description": "This character exhibits significant amounts of cruelty, which refers to actions that cause others to suffer. Their feelings should be malicious, indifferent, or otherwise lack remorse for the actions they commit while aware of their consequences."}, {"name": "Curious", "id": 1159, "description": "This character is <a href=\"http://en.wikipedia.org/wiki/Curiosity\">curious</a> (as in eager to learn something).\n\nA curious person often wants to know more just about anything that (s)he encounters. A curious person is willing to learn new things, and likes to question the people around them."}, {"name": "Cynic", "id": 245, "description": "This character acts in a <a href=\"http://dictionary.reference.com/browse/cynical\">cynical</a> way, showing contempt for accepted standards of honesty or morality by one's actions, especially by actions that exploit the scruples of others. It has little to no relation to Greek philosophy <a href=\"http://en.wikipedia.org/wiki/Cynicism\">cynicism</a>.\n\nA cynical person believes that only selfishness motivates human actions and disbelieves in or minimizes selfless acts or disinterested points of view."}, {"name": "Deredere", "id": 224, "description": "This character is a deredere, lovestruck from the begining of the story.\n\nDeredere characters are deeply in love with someone from the begining or early parts of the story and this is the centerpoint of all of their actions."}, {"name": "Dishonest", "id": 1324, "description": "A character with this trait is <a href=\"http://en.wikipedia.org/wiki/Dishonesty\">dishonest</a>. Perhaps they're not frequently dishonest (e.g., like a con artist or a pathological liar would be), but a dishonest act in the story defines their character and/or is a prominent plot point.\n\nDishonesty is to act without <a href=\"http://vndb.org/i822\">honesty</a>. It is used to describe a lack of probity, cheating, lying or being deliberately deceptive or a lack in integrity, knavishness, perfidiosity, corruption or treacherousness."}, {"name": "Docile", "id": 911, "description": "This character is <a href=\"http://en.wiktionary.org/wiki/docile\">docile</a>.\n\nDifferent from being <a href=\"http://vndb.org/i250\">shy</a> or <a href=\"http://vndb.org/i452\">timid</a>, docile people are not <a href=\"http://vndb.org/i248\">outgoing</a> and are typically very compliant."}, {"name": "Dogmatic", "id": 3916, "description": "This character is <a href=\"https://dictionary.cambridge.org/dictionary/english/dogmatic\">dogmatic</a>.\n\nDogmatic characters are very firm in their convictions, which usually come from some authority. The authority is often religious, but it doesn't have to be. They are inclined to lay down principles as undeniably true even despite evidence to the contrary."}, {"name": "Donkan", "id": 75, "description": "This character is blind against all romantic feelings and actions of people nearby.\n\nDonkan characters can't read the atmosphere at all. Some donkans may be smart like a genius but they still can't understand the romantic feelings of anyone until a clear confession is made. Even than they need to ask for a confirmation and think about it for a while."}, {"name": "Effeminate", "id": 1212, "description": "<a href=\"https://en.oxforddictionaries.com/definition/effeminate\">Effeminate characters are lacking in \"manliness\"</a>. He is unsure of himself and may act girlish. Not being able to fight back, he may become the subject of bullying by classmates. He blushes and loses the power of speech in the girl's company.\n\nAlso refers to male characters <a href=\"https://en.wikipedia.org/wiki/Sissy#Pejorative_sense\">who engage in activities</a> considered typical of the gender role of a girl- e.g. wearing feminine clothing or makeup.\n\nOnly use this for characters who are (or seem to be) male."}, {"name": "Emotional", "id": 1146, "description": "An emotional person is somebody that is easily affected by <a href=\"http://en.wikipedia.org/wiki/Emotional\">feelings</a>. Emotional people are prone to making decisions based on feelings and impulses rather than logic, pragmatism or reason."}, {"name": "Energetic", "id": 724, "description": "This character is unusually <a href=\"http://en.wikipedia.org/wiki/Hyperactivity\">energetic</a>.\n\nHyperactivity can be described as a physical state in which a person is abnormally active. The colloquial term hyper is used to describe someone who is in a hyperactive state."}, {"name": "Envious", "id": 1283, "description": "A character with this personality trait is frequently envious of others' various physical and non-physical possessions.\n\n<a href=\"http://en.wikipedia.org/wiki/Envy\">Envy</a> is a resentment which occurs when someone lacks another's quality, achievement or possession and wishes that the other lacked it.\n\nThough used synonymously with <a href=\"/i1284\">Jealousy</a> in modern English, the two words are different."}, {"name": "Family Oriented", "id": 2861, "description": "This character places a great importance on the notion of \"family\".\n\n\"Family\" can mean either the family the character comes from (siblings, father, mother, etc.) or the family they establish (husband / wife, daughter, son, etc.) or both."}, {"name": "Fear of Commitment", "id": 2727, "description": "The character is afraid of a long-term commitment to someone, saying otherwise, they are afraid of love. It's not a mental illness and can take different forms, depending on the person.\n\nThis fear is usually expressed by the rejection of those declaring their love or wanting to take the relationship to the next level (like marriage), possibly rethinking their actions later, when the fear has diminished."}, {"name": "Feminist", "id": 3420, "description": "This character is a  <a href=\"https://en.wikipedia.org/wiki/Feminist\">feminist</a>.\n\nFeminism is a range of social movements, political movements, and ideologies that aim to define and establish the political, economic, personal, and social equality of the sexes.\n\nMake sure to only apply this tag when the character is explicitly described as a feminist or is mentioned to want equality between genders either by themselves or another character."}, {"name": "Flustered", "id": 1300, "description": "The character easily panics and gets flustered easily. Usually when things does not go as planned/expected, the character will lose composure and panic and possibly screw up in some way."}, {"name": "Food Lover", "id": 719, "description": "This character loves to eat and is often, if not always, hungry."}, {"name": "Funny", "id": 604, "description": "This character is usually considered <a href=\"http://en.wikipedia.org/wiki/Funny\">funny</a>.\n\nHumour or humor is the tendency of particular cognitive experiences to provoke laughter and provide amusement.\n\nPeople of all ages and cultures respond to humour. The majority of people are able to experience humour, i.e., to be amused, to laugh or smile at something funny, and thus they are considered to have a sense of humour. The hypothetical person lacking a sense of humour would likely find the behaviour induced by humour to be inexplicable, strange, or even irrational. Though ultimately decided by personal taste, the extent to which an individual will find something humorous depends upon a host of variables, including geographical location, culture, maturity, level of education, intelligence and context."}, {"name": "Genre Savvy", "id": 234, "description": "This character knows a lot about the situation, just not personally.\n \nGenre savvy characters may be unfamiliar with their current situation, never experienced it before, but they certainly did read a story, saw a movie or played a game about \"just the same thing\". They would try to use these \"experiences\" to their advantage at every opportunity."}, {"name": "Gloomy", "id": 3265, "description": "The character's personality is filled with melancholy and have a downcast attitude.\n\nThey're the opposite of <a href=\"https://vndb.org/i2443\">cheerful</a>."}, {"name": "Gossipy", "id": 2693, "description": "This character often engages in spreading <a href=\"https://en.wikipedia.org/wiki/Gossip\">gossip</a> or rumors."}, {"name": "Grumbler", "id": 908, "description": "This character is grumbler.\n\nThe position of such characters is to go against the opinion of others and to complain about any events that occur around them. Such people are quite difficult to please."}, {"name": "Hard Worker", "id": 76, "description": "This character is a hardworking person.\n\nHardworker refers to a person that spends a lot of effort to succeed at the assigned tasks and achieve his/her goals."}, {"name": "Henpecked", "id": 1387, "description": "This character may seem cool and brutal for the audience until the moment his wife/girlfriend will come and say her word. In her presence he immediately becomes compliant and obedient. In other words, this kind of people humbly recognizes the leadership and authority of their woman. In some comedic stories women can even use a frying pan or other painful tool as an argument.\n\nNote that this trait has nothing to do with sexual submission. Use <a href=\"http://vndb.org/i1087\">Submissive Partner</a> in this case."}, {"name": "Hetare", "id": 216, "description": "This character is Hetare which is the opposite of <a href=\"/i74\">Proactive</a>.\n\nThis character is a worthless, spineless, undependable, lazy, inept and no help to anyone and most of the time unable to make any decisions in time.\n\nThis character is always being pushed around by every other characters in the game at the very start and they are still like that in the final moments of the game. They make other characters help them everytime before facing their own problems.\n\nPlease don't use this trait on games that have this character starting this way but also has him fixing his ways in the first hours of the game. Thus making it somewhat bearable by some quick reading.\nWhile this description says man, this trait can also be applied to worthless, spineless, good for nothing female characters."}, {"name": "Himedere", "id": 1997, "description": "A character that demands to be treated like royalty by his or her loved ones and may or may not actually be royalty."}, {"name": "Honest", "id": 822, "description": "This character is <a href=\"http://en.wikipedia.org/wiki/Honesty\">honest</a>.\n\nHonesty is associated with virtues such as integrity, truthfulness, and straightforwardness."}, {"name": "Honorable", "id": 431, "description": "This character is someone of <a href=\"http://en.wikipedia.org/wiki/Honor\">honor</a>.\n\nA honorable character acts in accordance with principles of honor, with dignity, distinction, and an illustrious, noble and distinguished way.\n\nThere are many definitions to being honorable, some are:\n\nThe Bushido code of the samurai that is said to have emphasized virtues such as loyalty, honor, obedience, duty, filial piety, and self-sacrifice.\n\nChivalry of medieval knights with ideals of knightly virtues, honor and courtly love, pride aspiring to beauty, and formalized pride giving rise to a conception of honor, which is states as the pole of noble life.\n\nIt should be noted that the principle idea is not being \"good\", but being \"just\" and \"true to one's word\" and in that sense even criminal organizations such as Yakuza consider themselves honorable.\n\nThis trait is intended to be used for characters that make it into a habit to mention that they are honorable, bound by a code of honor like Bushido or chivalry, just, fair, true-to-their-word, etc. And should not be applied to every character that looks honest."}, {"name": "Humble", "id": 3406, "description": "Humble characters tend to undersell themselves and don't try to take the spotlight. They are not haughty, proud or arrogant."}, {"name": "Idealist", "id": 1495, "description": "This character is an idealist, someone who is absorbed with living life the way they perceive it should be. They purposely overlook the darkness of human nature in favor of seeing everyone in an unrealistically good light. To an idealist, there are no such things as bad people. There are only bad situations people are in that force them to act a certain way. Finally, an idealist is someone who expects the best from people, not realizing that not everyone is willing to give up their time or money as willing as they are.\n\nThe opposite of a cynic, an idealist often has the nature of selflessness and believes in things like honor, justice, honesty, etc."}, {"name": "Idiot", "id": 231, "description": "This character sometimes acts like an  <a href=\"http://en.wikipedia.org/wiki/Idiot\">idiot</a>.\n\nAn idiot is a mentally deficient person, or someone who acts in a self-defeating or significantly counterproductive way."}, {"name": "Ignorant", "id": 236, "description": "This character is or seems <a href=\"http://en.wikipedia.org/wiki/Ignorance\">ignorant</a> and lacking <a href=\"http://en.wikipedia.org/wiki/Common_sense\">common sense</a>.\n\nIgnorant characters are unaware of most things that are considered common knowledge by regular people. It is not because they are incapable of learning, but usually because they just never got the chance to learn or didn't try.\n\nThey don't understand the things that are considered obvious by most people because their thought process is different doesn't usually end with the same results with others.\n\nTheir actions might seem stupid, meaningless and outright wrong, but that doesn't mean that they are stupid, cruel or evil, they are usually just different.\n\nAn ignorant character may be from a distant place or time or maybe he/she just got out of prison, or returned from a prolonged conflict.\n\nAn ignorant character is different from an uneducated one since it is not about education. Though a character may carry both of the traits."}, {"name": "Immature", "id": 891, "description": "This character doesn't act maturely.\n\n<a href=\"http://en.wikipedia.org/wiki/Maturity_%28psychological%29\">Maturity</a> is a psychological term used to indicate how a person responds to the circumstances or environment in an appropriate manner."}, {"name": "Incorruptible", "id": 2682, "description": "This character is morally strong enough not to be persuaded to do anything wrong: his way of thinking will not deteriorate and will not be destroyed by anyone, no matter how difficult his experiences.\n\nThis trait can be used (for example) for a character who can not be corrupted by money or for a character who is violated (by proxy or otherwise) by others but who would remain \"loyal\" to his lover and do not succumb to pleasures given of his rapist."}, {"name": "Insightful", "id": 1302, "description": "This character has a high perception of what other people do and think. They often see through of what other people is hiding, making them a dependable friend or a formidable opponent.\n\nThis might be caused by a long term of experience of observing people's act and conduct, or just simply have the talent for it which caused by their very own nature, such as having attentive care for others or merely being sly and deceitful.\n\nNote: Don't apply this trait to those who use telepathy."}, {"name": "Japanophile", "id": 3356, "description": "This character is a non-Japanese that is obsessed with Japan in general and/or Japanese culture in particular."}, {"name": "Jealous", "id": 1284, "description": "A character with this personality trait is often jealous of others.\n\n<a href=\"http://en.wikipedia.org/wiki/Jealousy\">Jealousy</a> is an emotion, and the word typically refers to the negative thoughts and feelings of insecurity, fear, and anxiety over an anticipated loss of something of great personal value, particularly in reference to an existing connection. Jealousy often consists of a combination of emotions such as anger, resentment, inadequacy, helplessness and disgust.\n\nThough jealous is used synonymously with <a href=\"http://vndb.org/i1283\">Envious</a> in modern English, the two words are different."}, {"name": "Jock", "id": 782, "description": "This character is refered to as a <a href=\"http://en.wikipedia.org/wiki/Jock_(athlete)#Stereotypical_characteristics_of_jocks\">Jock</a>.\n\nThe term jock, when used in the United States and Canada, refers to the classic stereotype of a male athlete. It is generally a negative stereotype, and is attributed mostly to high school and college athletics participants who form a distinct youth subculture. In sociology, the jock is thought to be included within the socialite subculture, which also contains the preps and Ivy-Leaguers. As a blanket term, jock can be considered synonymous with athlete. \n\nSimilar words that may mean the same as \"jock\" include \"meathead,\" \"musclebrain,\" and \"musclehead.\" These terms are based on the stereotype that a jock is muscular, but not very smart, and cannot carry a conversation on any topic other than one relating to sports or exercise.\n\nThis trait does not refer to the job but the personality stereotype that comes with the people that are usually associated with this job."}, {"name": "Kind", "id": 515, "description": "This character is <a href=\"http://en.wikipedia.org/wiki/Kindness\">kind</a>.\n\nKindness is the act or the state of being kind —ie. marked by goodness and charitable behaviour, mild disposition, pleasantness, tenderness and concern for others. It is known as a virtue, and recognized as a value in many cultures and religions."}, {"name": "Kuudere", "id": 220, "description": "This character is a kuudere, starts uninterested but turns lovestruck later.\n\nA kuudere starts cold, distant, uninterested and doesn't pay any attention to  potential love interests, but eventually turns lovestruck. Unlike the classic type, a kuudere doesn't get hostile with the other characters, but just ignores them."}, {"name": "Lazy", "id": 230, "description": "This character is a <a href=\"http://en.wikipedia.org/wiki/Laziness\">lazy</a> person.\n\nLaziness (also called indolence) is a disinclination to activity or exertion despite having the ability to do so."}, {"name": "Loner", "id": 1747, "description": "This character has a <a href=\"https://en.wikipedia.org/wiki/Loner\">lone wolf</a> type personality."}, {"name": "Loyal", "id": 818, "description": "During the story, this character exhibits behavior associated with the theme of <a href=\"http://en.wikipedia.org/wiki/Loyalty\">loyalty</a>.\n\nLoyalty is faithfulness or a devotion to a person, country, group, or cause."}, {"name": "Lucky", "id": 2662, "description": "This character has abnormally good luck. This might be a supernatural ability, or just the perception of other characters around them."}, {"name": "Mature", "id": 876, "description": "This character has a mature personality.\n\nIn terms of personality, this is a person fully developed in terms of thinking. If used to refer to a young person, their behavior is not typical of their age, as this person usually acts like a grown up or a more aged and wise one."}, {"name": "Misandrist", "id": 1162, "description": "This character is a <a href=\"http://en.wikipedia.org/wiki/Misandry\">misandrist</a> (one who hates men).\n\nMisandry is the hatred or dislike of men or boys. Misandry is the antonym of philandry, the fondness, love, or admiration of men. Misandry is a back-formation from misogyny, the hatred or dislike of women."}, {"name": "Misanthrope", "id": 1569, "description": "A character with this trait is a misanthrope.\n\n<a href=\"http://en.wikipedia.org/wiki/Misanthropy\">Misanthropy</a> is the general hatred, distrust or disdain of the human species or human nature. A misanthrope, or misanthropist is someone who holds such views or feelings."}, {"name": "Mischievous", "id": 1053, "description": "This character is mischievous.\n\nMischievous characters like to cause trouble in a playful way. Their actions may or may not be an annoyance to people around them."}, {"name": "Misogynist", "id": 1160, "description": "This character is a <a href=\"http://en.wikipedia.org/wiki/Misogyny\">misogynist</a>, a person who hates, dislikes, mistrusts, or mistreats women.\n\nMisogyny is the hatred or dislike of women or girls. Misogyny can be manifested in numerous ways, including sexual discrimination, denigration of women, violence against women, and sexual objectification of women. Misogyny has been characterised as a prominent feature of the mythologies of the ancient world as well as various religions. In addition, many influential Western philosophers have been described as misogynistic. The male counterpart of misogyny is misandry, the hatred or dislike of men; the antonym of misogyny is philogyny, the love or fondness of women."}, {"name": "Money Lover", "id": 779, "description": "This character has a goal of obtaining money anyway possible. Usually with a 'get rich quick scheme' or demanding money frequently.\nThis can also mean a character who does not like spending money, like those old meany misers."}, {"name": "Moody", "id": 1329, "description": "A character with this trait is <a href=\"http://dictionary.reference.com/browse/moody?s=t\">moody</a>. Regardless of whether they have an actual mental condition or not, their moods change at the drop of a hat. Moody characters tend to also be impulsive and whimsical."}, {"name": "Naive", "id": 628, "description": "This character is <a href=\"http://en.wikipedia.org/wiki/Naive\">naive</a>.\n\nNaive refers to someone having or showing a lack of experience, understanding or sophistication, someone having or showing unaffected simplicity of nature or absence of artificiality."}, {"name": "Nature Lover", "id": 780, "description": "These characters has a special place in their hearts for the environment, wildlife and plant life."}, {"name": "Nihilist", "id": 3460, "description": "This character is a <a href=\"https://en.wikipedia.org/wiki/Nihilism\">nihilist</a>.\n\nIn popular use, the term commonly refers to someone who has the belief that life is without intrinsic value, meaning, or purpose.\n\nOnly apply this trait to characters who are described as nihilists in universe, or have beliefs that are reflective of a nihilistic point of view."}, {"name": "No Sense of Direction", "id": 3257, "description": "This person tends to get lost very easily, even in familiar environment."}, {"name": "Obsessive", "id": 3054, "description": "The character has an obsession with something, or has a tendency to form obsessions.\n\nAn obsession is an intense or passionate fixation on a specific subject. While obsessiveness tends to have associations with unhealthy or abnormal fixations, it doesn't necessarily bely unhealthiness."}, {"name": "Old-fashioned", "id": 865, "description": "This character is <a href=\"http://en.wiktionary.org/wiki/old-fashioned\">old-fashioned</a>.\n\nRefers to a person that is behind the times, not up to date, preferring the customs of earlier times."}, {"name": "Optimist", "id": 1093, "description": "This character is an <a href=\"http://en.wikipedia.org/wiki/Optimism\">optimist</a>.\n\nOptimism is a mental attitude or world view that interprets situations and events as being best (optimized), meaning that in some way for factors that may not be fully comprehended, the present moment is in an optimum state. The concept is typically extended to include the attitude of hope for future conditions unfolding as optimal as well."}, {"name": "Otaku", "id": 223, "description": "This character is an <a href=\"http://en.wikipedia.org/wiki/Otaku\">otaku</a>.\n\nOtaku is a Japanese term used to refer to people with obsessive interests, particularly anime, manga, or video games."}, {"name": "Outgoing", "id": 248, "description": "This character is an <a href=\"http://en.wikipedia.org/wiki/Extroversion\">extrovert</a>.\n\nOutgoing characters tend to be fond of the company of others, assertive, and interested in seeking out excitement."}, {"name": "Pacifist", "id": 878, "description": "This character is a follower or believes in <a href=\"http://en.wikipedia.org/wiki/Pacifism\">pacifism</a>.\n\nPacifism is the opposition to war and violence.\n\nThe character does not like war or fighting. Preferring a non-violent, non-confrontational method to settle disputes."}, {"name": "Patriotic", "id": 636, "description": "The character is a patriot, a person who vigorously supports his country and its way of life.\n\n<a href=\"http://en.wikipedia.org/wiki/Patriotism\">Patriotism</a> is a devotion to one's country. In a generalized sense applicable to all countries and peoples, patriotism is a devotion to one's country for no other reason than being a citizen of that country."}, {"name": "Perfectionist", "id": 791, "description": "This character is a <a href=\"http://en.wikipedia.org/wiki/Perfectionism_(psychology)\">perfectionist</a>.\n\nPerfectionism is a belief that work or output that is anything less than perfect is unacceptable."}, {"name": "Personality Complex", "id": 3959, "description": "This is an umbrella trait to gather various personality complexes."}, {"name": "Pervert", "id": 232, "description": "This character's mind is usually occupied by sexual thoughts.\n\nPerverted characters think about sex all the time and they would do anything to get close to things that they consider erotic."}, {"name": "Pessimist", "id": 979, "description": "This character is a <a href=\"http://en.wikipedia.org/wiki/Pessimism\">pessimist</a>.\n\nPessimism is a state of mind in which one anticipates undesirable outcomes or believes that the evil or hardships in life outweighs the good or luxuries.\nThese characters typically expect everything to go wrong, often depressing others."}, {"name": "Pragmatic", "id": 1303, "description": "A <a href=\"http://dictionary.reference.com/browse/pragmatic?s=t\">pragmatic</a> person is somebody who makes decisions and takes action based on logical, practical and/or rational considerations and perspectives. It should be noted that pragmatic people aren't necessarily cold or unemotional."}, {"name": "Pretending", "id": 239, "description": "This character is faking his or her personality.\n\nPretending characters hide their true personality and act like someone else. They may be acting this way because of social pressure or out of a hidden agenda.\n\nThis trait is intended for characters that are pretending all or most of their personality, do not use it for ones that pretend one or two things in a game."}, {"name": "Primitive", "id": 2916, "description": "This character behaves in a primitive way, acting instinctively, and can even be described as a <a href=\"https://en.wikipedia.org/wiki/Primitive_culture\">savage</a>."}, {"name": "Proactive", "id": 74, "description": "The opposite of <a href=\"http://vndb.org/i216\">Hetare</a>.\n\nYou can rely on this type of characters to do what needs to be done. They aren't afraid to make decisions. They take the initiative and solve the problem, usually by themselves. Once they have a goal in mind, they'll approach it with prudence and tact.\n\nThey usually have talent/ability or connections that they know how to make best use of.\n\nCheck <a href=\"http://en.wikipedia.org/wiki/Proactivity_%28Proactive_behavior%29\">proactivity</a> or <a href=\"http://en.wikipedia.org/wiki/Conscientiousness\">conscientious</a> for more details.\n\nShould only be used when the character acted like this for the majority of the game."}, {"name": "Promiscuous", "id": 1562, "description": "This character is considered to be <a href=\"https://en.wikipedia.org/wiki/Promiscuity\">promiscuous</a>. They engage in sexual activity frequently and indiscriminately with different partners.\n\nPromiscuous characters sleep around not for money like a prostitute, but for their own satisfaction.\n\nA term frequently applied to an individual who is considered to have loose sexual morals or who is sexually promiscuous is a slut.\n\nThe term is generally pejorative and most often used as an insult, sexual slur or offensive term of disparagement (slut shaming). However, in recent times, there have been attempts to \"reclaim\" the word, while some individuals embrace the title as a source of pride."}, {"name": "Protective", "id": 725, "description": "This character acts like a doting, fawning parent towards another of the story characters. They may or may not be actual family members but \"the taking under one's wing\" and \"protecting against dangers\" are important parts of this behavior.\n\nThis trait is intended for mild cases which are most usually found in parents. Extreme cases of this behavior results in acting <a href=\"http://vndb.org/i556\">Possessive</a>, which is presented as a child trait to this."}, {"name": "Rebellious", "id": 2023, "description": "Refusing to be told what to do or how to act, these characters will regularly lash out at authority, either passively or overtly, and often times reject the accepted mores of society. Examples of rebellious behavior include skipping school, smoking cigarettes, and getting into frequent arguments with authority figures such as teachers and parents.\n\nNote that the motivation behind their behavior is important. Not all smokers or school skippers, or smoking school skippers, are rebellious. Their actions have to be primarily motivated purely by the will to defy."}, {"name": "Refined", "id": 470, "description": "This character is <a href=\"http://dictionary.reference.com/browse/refined\">refined</a>.\n\nRefined characters are mostly from upper class families and are  usually described as cultivated, polished, polite, courteous, civilized, courtly, genteel and elegant."}, {"name": "Relaxed", "id": 432, "description": "This character has a relaxed attitude.\n\nRelaxed characters act without <a href=\"http://en.wikipedia.org/wiki/Anxiety\">anxiety</a> or <a href=\"http://en.wikipedia.org/wiki/Worry\">worry</a>. They may have solid reasons for doing so, like having made all possible preparations for a situation, or they may be prepared to accept the negative consequences."}, {"name": "Religious Belief", "id": 875, "description": "This meta-trait is designed to gather all traits regarding characters' <a href=\"http://en.wikipedia.org/wiki/Religion\">religious beliefs</a> that came strongly forward during games' stories."}, {"name": "Reserved", "id": 249, "description": "This character is an <a href=\"http://en.wikipedia.org/wiki/Introversion\">introvert</a>.\n\nIntrovert characters tend to be more reserved, less outgoing, and less sociable. They are not necessarily loners but they tend to be satisfied with having fewer friends. Introversion does not describe social discomfort but rather social preference: an introvert may not be shy but may merely prefer less social activities."}, {"name": "Resilient", "id": 3902, "description": "This character has a strong psyche allowing them to withstand most of life’s hardships without breaking, experiencing mental breakdown or going insane."}, {"name": "Romantic", "id": 2944, "description": "This character is a <a href=\"https://en.wikipedia.org/wiki/Romance_(love)\">romantic</a>.\n\nA romantic is inclined toward or suggestive of the feeling of excitement and mystery associated with love, and/or of an idealized view of reality when it comes to romance. They value their emotions greatly, and like the subtler aspects of romance, as well as most romance-themed situations, like confessions or happy couples. They appreciate gestures that are romantically pronounced, like offering flowers, and are fans of environments that contribute to a romantic mood, like a full moon. The person may be a romantic due to a traditional upbringing, or a naive ignorance of love, sometimes influenced by fiction."}, {"name": "Romantically Indecisive", "id": 233, "description": "This character can't make a decision between romantic interests.\n\nRomantically indecisive characters are unsure about whom they love more and are afraid to hurt the one that would get left behind. While trying to not to hurt anyone, they cause immense grief to any parties involved."}, {"name": "Rude", "id": 534, "description": "This character is generally <a href=\"http://en.wikipedia.org/wiki/Rude\">rude</a>.\n\nRudeness is a display of disrespectfulness by not complying with the social \"laws\" or etiquette of a group or culture.\n\nThese laws have been established as the essential boundaries of normally accepted behavior. To be unable or unwilling to align one's behavior with these laws known to the general population of what is socially acceptable is to be rude."}, {"name": "Secretive", "id": 154, "description": "This character acts <a href=\"http://dictionary.reference.com/browse/secretive\">secretive</a>.\n\nA secretive character is keeping an important secret, hiding something from the rest of the characters.\n\nBased on the character he/she might not mind keeping it at all. But he/she might also be under great stress either due to worry that the secret will get out or might be battling the desire to tell it and be free."}, {"name": "Selfish", "id": 242, "description": "This character is <a href=\"http://en.wikipedia.org/wiki/Selfish\">selfish</a>.\n\nSelfishness denotes an excessive or exclusive concern with oneself; and as such it exceeds mere self interest or self concern. In that it necessarily connotes a disregard for others, it is beyond the act of placing one's own needs or desires above the needs or desires of others (self interest)."}, {"name": "Sensitive", "id": 1559, "description": "A character with this trait is sensitive.\n\nA <a href=\"http://www.oxforddictionaries.com/definition/english/sensitive\">sensitive</a> person is one who has or displays a quick and delicate appreciation of others' feelings. They tend to be easily hurt, offended or upset."}, {"name": "Serious", "id": 821, "description": "This character has a <a href=\"http://en.wikipedia.org/wiki/Seriousness\">serious</a> personality.\n\nSerious people treat everything with an attitude of gravity and earnestness.\n\nThe opposite of <a href=\"http://vndb.org/i432\">relaxed</a>."}, {"name": "Short-tempered", "id": 469, "description": "This character is <a href=\"http://dictionary.reference.com/browse/short-tempered\">short-tempered</a>.\n\nA short-tempered person is easily moved to anger.\n\n<a href=\"http://en.wikipedia.org/wiki/Angry\">Anger</a> is an emotion related to one's psychological interpretation of having been offended, wronged or denied and a tendency to undo that by retaliation.\n\nThe external expression of anger can be found in facial expressions, body language, physiological responses, and at times in public acts of aggression."}, {"name": "Sleepyhead", "id": 1442, "description": "This person loves to sleep much more, than their physical condition may require. They fall asleep readily, sometimes during the class lessons, and tends to oversleep in the mornings, being regularly late for school or work."}, {"name": "Sloppy", "id": 1743, "description": "This character lacks of elegance, neatness and order. They're rarely watching their appearance, being unfamiliar with the mirror, and their apartment is in a mess most of the time."}, {"name": "Smart", "id": 716, "description": "This character is shown to be <a href=\"http://en.wikipedia.org/wiki/Intelligence\">intelligent</a>.\n\nSmart is used when referring to a person with good understanding or a high mental capacity, someone who is quick to comprehend."}, {"name": "Stoic", "id": 235, "description": "This character doesn't display any kinds of emotions outside.\n\nStoic characters act like they don't have feelings, except in very rare moments, when they talk or act no emotional expressions appear on their faces nor can be noticed from their movements.\n\nThis doesn't mean these characters don't feel anything, but that they don't show any outside. They can have psychological problems resulting in this behavior or may have an another reason to act this way."}, {"name": "Strange", "id": 663, "description": "This character is considered <a href=\"http://dictionary.reference.com/browse/Strange\">strange</a> by the people around.\n\nA strange character speaks and behaves in a different way then the surrounding people, who consider him/her off, odd, weird or even repulsive/attractive."}, {"name": "Stubborn", "id": 575, "description": "This character is <a href=\"http://dictionary.reference.com/browse/stubborn\">stubborn</a>.\n\nStubborn characters are unreasonably, often perversely unyielding and bullheaded. They are firmly resolved or determined and resolute. Characterized by their perseverance, they are difficult to treat or deal with and resistant to treatment or efforts."}, {"name": "Stylish", "id": 1334, "description": "This character is stylish.\n\nA stylish person is someone who tries to keep pace with the latest fashion trends to dress elegantly and/or stunningly."}, {"name": "Superficial", "id": 1105, "description": "A superficial person is one who lacks substance, and tends to be materialistic. They judge others based on appearances, wealth, social standing or otherwise, purely surface values. In romantic situations, a superficial person (usually) only takes interest in those who are good-looking, rich and/or high in social value."}, {"name": "Superstitious", "id": 3274, "description": "The character believes in irrational, unscientific, and/or supernatural forces."}, {"name": "Taciturn", "id": 1379, "description": "This character is taciturn.\n\nThis character is physically able to speak, but prefers to remain silent because of their serious/sullen personality or mental affliction. Apply this trait only to those who spoke at least once in the story or when there was other proof of their ability to speak."}, {"name": "Talkative", "id": 1249, "description": "This character loves to talk. However, the topic he started is not always meaningful, which often annoys his companions, especially when they want to enjoy the silence."}, {"name": "Talking Patterns", "id": 225, "description": "These are the traits about notable talking patterns that make this character stand out."}, {"name": "Thrifty", "id": 3238, "description": "This character is associated with <a href=\"https://en.wikipedia.org/wiki/Frugality\">Frugality</a>.\n\nA character of this trait prefers not to be wasteful or extravagant in their resource consumption, especially with money. They might have reasons behind it, such as living in poverty, or simply being well-taught by their parents. They are often, but not necessarily, viewed by others to be stingy."}, {"name": "Timid", "id": 452, "description": "This character is <a href=\"http://dictionary.reference.com/browse/timid\">timid</a>. A timid character is someone who is lacking in courage or confidence in everyday interactions.\n\nThey usually will face the challange if there are enough reasons to do so (like saving their friend, or won't watch any scary movie if it's not a popular film that will help them to blend in with others), but they scare themselves to death when facing the thing. Popular example would be <a href=\"/c51035\">Niimi Sora</a>."}, {"name": "Tomboy", "id": 626, "description": "This character is or acts like a <a href=\"http://en.wikipedia.org/wiki/Tomboy\">tomboy</a>.\n\nA tomboy is a girl who exhibits some characteristics and or behavior considered typical of the gender role of a boy, including the wearing of typically masculine-oriented types of clothes and engaging in games and activities that are often physical in nature, and which are considered in many cultures to be the domain of boys."}, {"name": "Tsundere", "id": 217, "description": "This character is a <a href=\"http://en.wikipedia.org/wiki/Tsundere\">tsundere</a>.\n\nTsundere is a Japanese character development process which describes a person who is initially cold and even hostile towards another person before gradually showing their warm side over time."}, {"name": "Uneducated", "id": 237, "description": "This character had little to no <a href=\"http://en.wikipedia.org/wiki/Education\">education</a>.\n\nUneducated characters never had much experience with schools or private tutors and they don't have any knowledge of any of the subjects thought in one, like mathematics, science and history. At worst case an uneducated character may not even know how to read or write.\n\nAn uneducated character is different from an ignorrant one since it is not about common knowledge. Though a character may carry both of the traits."}, {"name": "Unlucky", "id": 3034, "description": "This character is notably unlucky and misfortune seems to follow them."}, {"name": "Vindictive", "id": 775, "description": "This character has a <a href=\"http://dictionary.reference.com/browse/vindictive\">vindictive</a> nature.\n\nSuch a character would be disposed or inclined to revenge, or in milder cases would hold grudges for a long time and be slow to forgive."}, {"name": "Violent", "id": 1118, "description": "This character is violent.\n\nViolent characters prefer the usage physical force or power against others that can result in injuries, death, physiological scars or other forms of serious harm."}, {"name": "Whimsical", "id": 1330, "description": "A character with this trait is <a href=\"http://dictionary.reference.com/browse/whimsical\">whimsical</a>. These characters act and make decisions on a whim. They change their tune on things at a moment's notice. It's often hard to tell what they're planning next."}, {"name": "Wise", "id": 1399, "description": "This character is endowed with <a href=\"http://en.wikipedia.org/wiki/Wisdom\">wisdom</a>.\n\nWisdom is the ability to think and act using knowledge, experience, common sense, and insight. This quality is usually inherent to middle-aged and old people, who have seen many things in their life, and can give a good advice to those who may need it."}, {"name": "Womanizer", "id": 824, "description": "This character is a <a href=\"http://en.wikipedia.org/wiki/Promiscuity#Male_promiscuity\">womanizer</a>.\n\nA person is considered a womanizer if they have frequent relationships with various women and show no sign of commitment. \nThey may often engage in <a href=\"http://vndb.org/i755\">flirting</a>.\n\nThe trait can be used both for male and female characters."}, {"name": "Yandere", "id": 221, "description": "This character is a <a href=\"http://en.wikipedia.org/wiki/Yandere#Y\">yandere</a>.\n\nYandere is a Japanese term for a person who is initially very loving and gentle to someone before their devotion becomes destructive in nature, often through violence. Yandere characters are mentally unstable, often using extreme violence as an outlet for their emotions.\n\nUnlike Yangire characters, yandere characters' actions are motivated by love."}, {"name": "Yangire", "id": 222, "description": "This character is a <a href=\"http://en.wikipedia.org/wiki/Yandere#Y\">yangire</a>.\n\nYangire is used to describe a character who is mentally ill and snaps instantly without showing affection for the victim of their outbursts.\n\nJust like yandere characters, yangire characters star very loving and gentle, and suddenly turn out violent, but the difference is that yangire characters' actions are not related to romantic feelings."}]}